-- --------------------------------------------------------
-- Host:                         localhost
-- Server version:               10.4.11-MariaDB - mariadb.org binary distribution
-- Server OS:                    Win64
-- HeidiSQL Version:             9.4.0.5142
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Dumping data for table db_senpai.question_classes: ~13 rows (approximately)
/*!40000 ALTER TABLE `question_classes` DISABLE KEYS */;
INSERT INTO `question_classes` (`qc_id`, `qc_name`, `qc_parent`, `qc_sort`, `created_at`, `updated_at`, `deleted_at`) VALUES
	(1, 'センパイ（出品者）向け', 0, 255, '2022-03-23 18:38:07', NULL, NULL),
	(2, 'コウハイ（購入者）向け', 0, 255, '2022-03-23 18:38:07', NULL, NULL),
	(3, 'センパイについて', 0, 255, '2022-03-23 18:38:07', NULL, NULL),
	(4, 'アカウントについて', 0, 255, '2022-03-23 18:38:07', NULL, NULL),
	(5, '各種機能・その他', 0, 255, '2022-03-23 18:38:07', NULL, NULL),
	(6, 'センパイとは？', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(7, 'レッスンの出品・編集・削除', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(8, '掲示板募集への提案', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(9, '出勤登録・出勤カレンダー', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(10, '出勤リクエスト', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(11, '予約リクエスト', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(12, '予約確定からレッスンまで', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(13, 'レッスン当日のやりとり', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(14, 'クーポン', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(15, 'キャンセル・返金', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(16, '売上の確定・手数料', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(17, '売上金の振込', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(18, 'トラブルが発生した場合', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(19, '評価について', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(20, '注意事項', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(21, '確定申告・納税・源泉徴収', 1, 255, '2022-03-23 18:38:07', NULL, NULL),
	(22, 'コウハイとは？', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(23, 'レッスンの検索', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(24, '掲示板の募集投稿', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(25, '出勤リクエスト', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(26, '予約リクエストと購入', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(27, '予約確定からレッスンまで', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(28, 'レッスン当日のやりとり', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(29, 'クーポン', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(30, 'お支払い・サービス料', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(31, 'キャンセル・返金', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(32, 'トラブルが発生した場合', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(33, '評価について', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(34, '注意事項', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(35, '領収書の発行', 2, 255, '2022-03-23 18:38:07', NULL, NULL),
	(36, 'センパイとは？', 3, 255, '2022-03-23 18:38:07', NULL, NULL),
	(37, 'お友達の招待', 3, 255, '2022-03-23 18:38:07', NULL, NULL),
	(38, 'ルール・マナー', 3, 255, '2022-03-23 18:38:07', NULL, NULL),
	(39, '個人情報・セキュリティ', 3, 255, '2022-03-23 18:38:07', NULL, NULL),
	(40, 'ユーザー登録・変更', 4, 255, '2022-03-23 18:38:07', NULL, NULL),
	(41, 'ユーザー情報の変更・退去', 4, 255, '2022-03-23 18:38:07', NULL, NULL),
	(42, 'ログイン', 4, 255, '2022-03-23 18:38:07', NULL, NULL),
	(43, '本人確認', 4, 255, '2022-03-23 18:38:07', NULL, NULL),
	(44, '「こだわ」とは', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(45, '運営からお知らせ・連絡', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(46, 'フォローとフォロワー', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(47, 'ブロックと通報', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(48, '不具合報告', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(49, 'ご意見・ご要望', 5, 255, '2022-03-23 18:38:07', NULL, NULL),
	(50, 'その他', 5, 255, '2022-03-23 18:38:07', NULL, NULL);

/*!40000 ALTER TABLE `question_classes` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
